app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 762146111], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Foo Bar"], ["email", "foo@bar.com"], ["updated_at", 2017-03-16 07:18:29 UTC], ["id", 762146111]]
---
  def update
  	@user = User.find(params[:id])
  	if @user.update_attributes(user_params)